In [461]:
import os
from pathlib import Path
import pandas as pd
import numpy as np
os.getcwd()

'C:\\Users\\marti\\Desktop\\24_SortPictures'

In [478]:
dir_path = Path(r"C:\Users\marti\Desktop\24_SortPictures\workspace/")
dir_path = Path(r"C:\Users\marti\Desktop\24_SortPictures\workspace - Copie/")
dir_path = Path(r"F:\DDEM\Photos from mars 2014\2022")
vrac_filepath = dir_path / "VRAC"
print(vrac_filepath)

F:\DDEM\Photos from mars 2014\2022\VRAC

In [479]:
NAME_COL="name"
SIZE_COL="size"
FOLDER_COL="folder"
SUBFOLDER_COL="folder"

In [480]:
search_dir_paths = [
        path for path in Path(vrac_filepath).parent.iterdir()
        if path.is_dir() and path != Path(vrac_filepath)
]
search_dir_paths

[WindowsPath('F:/DDEM/Photos from mars 2014/2022/2022__01'),
 WindowsPath('F:/DDEM/Photos from mars 2014/2022/2022__02'),
 WindowsPath('F:/DDEM/Photos from mars 2014/2022/2022__03'),
 WindowsPath('F:/DDEM/Photos from mars 2014/2022/2022__04'),
 WindowsPath('F:/DDEM/Photos from mars 2014/2022/2022__05'),
 WindowsPath('F:/DDEM/Photos from mars 2014/2022/2022__06'),
 WindowsPath('F:/DDEM/Photos from mars 2014/2022/2022__07'),
 WindowsPath('F:/DDEM/Photos from mars 2014/2022/2022__09'),
 WindowsPath('F:/DDEM/Photos from mars 2014/2022/2202_Vanves')]

In [481]:
def scan_files_in_paths(search_dir_paths):
# if 1:
    ar = np.empty((0, 3))
    for dir_path in search_dir_paths:
        print(dir_path)
        for file in [i for i in dir_path.rglob('*')][:]:
            # print(f"file {file}")
            if file.is_file():
                # print("file is a file")
                ar_i = np.array([[file.name, file.stat().st_size, str(file.relative_to(dir_path.parent).parent) ]])
                ar = np.concatenate((ar, ar_i), axis=0)                        
    # print(ar)
    df=pd.DataFrame(columns = [NAME_COL, SIZE_COL, FOLDER_COL], data=ar)
    # print(df)
    return df
# df.head(100)

In [482]:
scan_df = scan_files_in_paths(search_dir_paths)
scan_df.head(10)

F:\DDEM\Photos from mars 2014\2022\2022__01
F:\DDEM\Photos from mars 2014\2022\2022__02
F:\DDEM\Photos from mars 2014\2022\2022__03
F:\DDEM\Photos from mars 2014\2022\2022__04
F:\DDEM\Photos from mars 2014\2022\2022__05
F:\DDEM\Photos from mars 2014\2022\2022__06
F:\DDEM\Photos from mars 2014\2022\2022__07
F:\DDEM\Photos from mars 2014\2022\2022__09
F:\DDEM\Photos from mars 2014\2022\2202_Vanves

           name     size    folder
0  BDHN4188.JPG  6440972  2022__01
1  BGVD8526.JPG    81617  2022__01
2  BNRR7066.JPG  3714558  2022__01
3  BRSC5263.JPG    95300  2022__01
4  BZFD2341.JPG   216507  2022__01
5  CGGJ5037.JPG  6684747  2022__01
6  CRVQ8186.JPG   111215  2022__01
7  DLQH9222.JPG   353640  2022__01
8  DOCO0698.JPG  5382256  2022__01
9  DQPB6548.JPG    93674  2022__01

In [483]:
scan_df.query(f'{SIZE_COL}.isna()')

Empty DataFrame
Columns: [name, size, folder]
Index: []

In [484]:
vrac_df = scan_files_in_paths([vrac_filepath])
vrac_df.head()

F:\DDEM\Photos from mars 2014\2022\VRAC

                         name     size folder
0  PXL_20220925_100546898.jpg  3341460   VRAC
1  PXL_20220925_111723575.jpg  3429604   VRAC
2  PXL_20220925_111725156.jpg  3574214   VRAC
3  PXL_20220925_111755844.mp4  6917755   VRAC
4  PXL_20220925_111804879.jpg  3802880   VRAC

In [485]:
vrac_df.query(f'{SIZE_COL}.isna()')

Empty DataFrame
Columns: [name, size, folder]
Index: []

In [486]:
dupl_df = pd.merge(
    left=vrac_df.filter(items=[NAME_COL, SIZE_COL]),
    right=scan_df,
    on=[NAME_COL, SIZE_COL],
    how='left'
)
dupl_df

                             name     size folder
0      PXL_20220925_100546898.jpg  3341460    NaN
1      PXL_20220925_111723575.jpg  3429604    NaN
2      PXL_20220925_111725156.jpg  3574214    NaN
3      PXL_20220925_111755844.mp4  6917755    NaN
4      PXL_20220925_111804879.jpg  3802880    NaN
..                            ...      ...    ...
696    PXL_20221231_162746184.jpg  2217828    NaN
697    PXL_20221231_215201755.jpg  2233747    NaN
698    PXL_20221231_224657114.jpg  3737349    NaN
699    PXL_20221231_224707469.jpg  4206978    NaN
700  PXL_20221231_224707469~2.jpg  2403679    NaN

[701 rows x 3 columns]

In [487]:
to_sup_df = dupl_df.query(
    f'{FOLDER_COL}.notna()'
)
to_sup_df.head(100)

Empty DataFrame
Columns: [name, size, folder]
Index: []

In [488]:
to_sup_df.size

0

In [489]:
size_ko = to_sup_df.filter(items=[SIZE_COL]).astype({SIZE_COL: np.int64}).sum().values[0]
size_ko

np.int64(0)

In [490]:
print(f'{size_ko/1000000} Mo')

0.0 Mo

In [491]:
to_sup_df.to_csv(Path(dir_path, "Removing_duplicates_export.csv"), sep = ";", index=False)

In [492]:
if 0:
    for i, r in to_sup_df.iterrows():
        filepath = Path(vrac_filepath, r[NAME_COL])
        print("Removing", filepath, "\t", r[FOLDER_COL])
        try:
            filepath.unlink()
        except:
            print("BUT NOT FOUND")

In [425]:
df1 = pd.DataFrame({
    'id': [3, 4, 5, 6],
    'age': [23, 34, 45, 56],
    'z': [54, 44, 44, 44]
})
df1

   id  age   z
0   3   23  54
1   4   34  44
2   5   45  44
3   6   56  44

In [426]:
df2 = pd.DataFrame({
    'id': [3, 4, 5, 6],
    'age': [23, 34, 8, 56],
    'z': [54, 44, 8, 44]
})
df2

   id  age   z
0   3   23  54
1   4   34  44
2   5    8   8
3   6   56  44

In [427]:
dd = pd.merge(
    left=df1.filter(items=['id', 'age']),
    right=df2,
    on=['id', 'age'],
    how='inner'
)
dd

   id  age   z
0   3   23  54
1   4   34  44
2   6   56  44